; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v3 ?v12)
             (pred_5 ?v13 ?v10)
             (pred_3 ?v3 ?v10)
             (pred_8 ?v11 ?v3 )
	     (pred_7 ?v3)
             (pred_9 ?v9)
             (pred_1 ?v13)
             (pred_11 ?v10)
             (pred_12 ?v3)
             (pred_6 ?v13)
             (pred_10 ?v3)
             (pred_2 ))



(:action op_2
:parameters (?v2 ?v1 ?v5 ?v8)
:precondition (and (pred_9 ?v2) (pred_9 ?v1) (pred_1 ?v5) (pred_11 ?v8)
          (pred_4 ?v2 ?v1) (pred_5 ?v5 ?v8)
                   (pred_3 ?v1 ?v8) (pred_7 ?v2) 
                   (pred_12 ?v1) (pred_6 ?v5))
:effect (and  (pred_10 ?v1) (not (pred_12 ?v1))))


(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_9 ?v2) (pred_9 ?v4)
               (pred_7 ?v2) (pred_4 ?v2 ?v4) (pred_10 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v2))))

(:action op_3
:parameters (?v2 ?v5)
:precondition (and (pred_9 ?v2) (pred_1 ?v5) 
                  (pred_7 ?v2) (pred_8 ?v5 ?v2) (pred_2 ))
:effect (and (pred_6 ?v5)
   (not (pred_8 ?v5 ?v2)) (not (pred_2 ))))


(:action op_1
:parameters (?v2 ?v7 ?v6)
:precondition (and (pred_9 ?v2) (pred_1 ?v7) (pred_1 ?v6)
                  (pred_7 ?v2) (pred_6 ?v6) (pred_8 ?v7 ?v2))
:effect (and (pred_6 ?v7) (pred_8 ?v6 ?v2)
        (not (pred_6 ?v6)) (not (pred_8 ?v7 ?v2))))

(:action op_5
:parameters (?v2 ?v5)
:precondition (and (pred_9 ?v2) (pred_1 ?v5) 
                  (pred_7 ?v2) (pred_6 ?v5))
:effect (and (pred_2 ) (pred_8 ?v5 ?v2) (not (pred_6 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_01 obj_02 obj_13 obj_17 obj_18 obj_14 obj_19 obj_20 obj_21 obj_03 obj_12 obj_15 obj_09 obj_05 obj_10
    obj_07 obj_16
    obj_11 obj_04 obj_08
    )

    (:init
       (pred_2)

       (pred_9 obj_06)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_21)
       (pred_9 obj_03)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_09)
       (pred_9 obj_05)
       (pred_9 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_08)

       (pred_4 obj_06 obj_17)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_13)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_13 obj_02)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_17 obj_18)
       (pred_4 obj_17 obj_06)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_18 obj_14)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_18 obj_17)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_18)
       (pred_4 obj_19 obj_12)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_21)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_03)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_20)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_21)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_12 obj_19)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_15 obj_09)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_10 obj_05)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_3  obj_05 obj_07)
       (pred_3  obj_15 obj_16)
       (pred_3  obj_19 obj_07)
       (pred_10 obj_06)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_21)
       (pred_10 obj_03)
       (pred_10 obj_12)
       (pred_10 obj_09)
       (pred_10 obj_10)

       (pred_5  obj_11 obj_07)
       (pred_5  obj_04 obj_16)
       (pred_5  obj_08 obj_16)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_08 obj_01)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_8 obj_11 obj_03)
       (pred_8 obj_04 obj_06)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_4 obj_09 obj_21)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_21)
   goals met: 0 of 2
2. (op_4 obj_21 obj_18)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_18)
   goals met: 0 of 2
3. (op_4 obj_18 obj_01)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_01)
   goals met: 0 of 2
4. (op_4 obj_01 obj_02)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_02)
   goals met: 0 of 2
5. (op_4 obj_02 obj_13)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_13)
   goals met: 0 of 2
6. (op_3 obj_13 obj_04)
   deleted: (pred_8 obj_04 obj_13) (pred_2)
   added: (pred_6 obj_04)
   goals met: 0 of 2
7. (op_4 obj_13 obj_02)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_02)
   goals met: 0 of 2
8. (op_4 obj_02 obj_01)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_01)
   goals met: 0 of 2
9. (op_4 obj_01 obj_06)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_06)
   goals met: 0 of 2
10. (op_5 obj_06 obj_04)
   deleted: (pred_6 obj_04)
   added: (pred_2) (pred_8 obj_04 obj_06)
   goals met: 1 of 2
11. (op_4 obj_06 obj_01)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_01)
   goals met: 1 of 2
12. (op_4 obj_01 obj_02)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_02)
   goals met: 1 of 2
13. (op_4 obj_02 obj_13)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_13)
   goals met: 1 of 2
14. (op_3 obj_13 obj_11)
   deleted: (pred_8 obj_11 obj_13) (pred_2)
   added: (pred_6 obj_11)
   goals met: 1 of 2
15. (op_2 obj_13 obj_19 obj_11 obj_07)
   deleted: (pred_12 obj_19)
   added: (pred_10 obj_19)
   goals met: 1 of 2
16. (op_4 obj_13 obj_19)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_19)
   goals met: 1 of 2
17. (op_4 obj_19 obj_12)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_12)
   goals met: 1 of 2
18. (op_4 obj_12 obj_03)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_03)
   goals met: 1 of 2
19. (op_5 obj_03 obj_11)
   deleted: (pred_6 obj_11)
   added: (pred_2) (pred_8 obj_11 obj_03)
   goals met: 2 of 2
